; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star2 - direction
	GroundStation7 - direction
	Star11 - direction
	Star13 - direction
	GroundStation14 - direction
	GroundStation10 - direction
	Star6 - direction
	Star3 - direction
	Star0 - direction
	Star5 - direction
	GroundStation9 - direction
	GroundStation4 - direction
	Star8 - direction
	Star1 - direction
	GroundStation12 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation14)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 GroundStation10)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation10)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 GroundStation12)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star0)
	(supports instrument9 thermograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 Star1)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation12)
	(calibration_target instrument10 Star1)
	(calibration_target instrument10 Star8)
	(calibration_target instrument10 GroundStation4)
	(calibration_target instrument10 GroundStation9)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite2 GroundStation9)
	(have_image Star15 infrared0)
	(have_image Phenomenon16 infrared0)
	(have_image Star17 thermograph1)
	(have_image Planet18 infrared0)
	(have_image Star19 thermograph1)
	(have_image Phenomenon20 thermograph1)
	(have_image Planet21 infrared0)
))

)

; plan
1. (turn_to satellite2 groundstation9 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 groundstation9)
   goals met: 1 of 9
2. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 1 of 9
3. (calibrate satellite1 instrument6 star6)
   added: (calibrated instrument6)
   goals met: 1 of 9
4. (turn_to satellite1 planet18 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet18)
   goals met: 1 of 9
5. (take_image satellite1 planet18 instrument6 infrared0)
   added: (have_image planet18 infrared0)
   goals met: 2 of 9
6. (turn_to satellite1 phenomenon20 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon20)
   goals met: 2 of 9
7. (take_image satellite1 phenomenon20 instrument6 thermograph1)
   added: (have_image phenomenon20 thermograph1)
   goals met: 3 of 9
8. (turn_to satellite1 phenomenon16 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 phenomenon16)
   goals met: 3 of 9
9. (turn_to satellite0 star3 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star3)
   goals met: 4 of 9
10. (take_image satellite1 phenomenon16 instrument6 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 5 of 9
11. (turn_to satellite1 planet21 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet21)
   goals met: 5 of 9
12. (take_image satellite1 planet21 instrument6 infrared0)
   added: (have_image planet21 infrared0)
   goals met: 6 of 9
13. (turn_to satellite1 star15 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star15)
   goals met: 6 of 9
14. (take_image satellite1 star15 instrument6 infrared0)
   added: (have_image star15 infrared0)
   goals met: 7 of 9
15. (turn_to satellite1 star17 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star17)
   goals met: 7 of 9
16. (take_image satellite1 star17 instrument6 thermograph1)
   added: (have_image star17 thermograph1)
   goals met: 8 of 9
17. (turn_to satellite1 star19 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star19)
   goals met: 8 of 9
18. (take_image satellite1 star19 instrument6 thermograph1)
   added: (have_image star19 thermograph1)
   goals met: 9 of 9
